app/Http/Controllers/Web/WebController.php

select * from `categories` where `home_status` = 1
select * from `reviews` where `reviews`.`product_id` in (42, 43, 44)
select * from `categories` where `position` = 0
select * from `brands`
---
    public function home()
    {
        $home_categories = Category::where('home_status', true)->get();
        $home_categories->map(function ($data) {
            $data['products'] = Product::active()->whereJsonContains('category_ids', ['id' => (string) $data['id']])->inRandomOrder()->get();
        });
        //products based on top seller
        $top_sellers = Seller::approved()->with('shop')
            ->withCount(['orders'])->orderBy('orders_count', 'DESC')->take(15)->get();
        //end

        //feature products finding based on selling
        $featured_products = Product::with(['reviews'])->active()
            ->where('featured', 1)
            ->withCount(['order_details'])->orderBy('order_details_count', 'DESC')
            ->take(12)
            ->get();
        //end

        $latest_products = Product::with(['reviews'])->active()->orderBy('id', 'desc')->take(8)->get();
        $categories = Category::where('position', 0)->get();
        $brands = Brand::get();

select `deal_of_the_days`.*, `products`.`unit_price` from `deal_of_the_days` inner join `products` on `products`.`id` = `deal_of_the_days`.`product_id` where `deal_of_the_days`.`status` = 1 limit 1
---
        Session()->forget('ordered');
        Session()->forget('payment_status');

        $deal_of_the_day = DealOfTheDay::join('products', 'products.id', '=', 'deal_of_the_days.product_id')->select('deal_of_the_days.*', 'products.unit_price')->where('deal_of_the_days.status', 1)->first();